export const inputEmailRegex = /^(([^<>()\[\]\\.,;:\s@"]+(\.[^<>()\[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/;
export const inputNameRegex = /^[а-яА-ЯёЁ\s]+$/;
export const inputTelRegex = /^\+?[0-9\s]*$/;
export const inputsErorMes = {
  name: {
    true: "введите имя и фамилию автора",
    false: "ошибка, имя введено не верно. Используйте только Кириллицу",
  },
  tel: {
    true: "введите номер в формате: +7 909 967 38 82",
    false: "ошибка, номер должен быть в формате: +7 909 967 38 82",
  },
  email: {
    true: "введите email",
    false: "ошибка, email введен не верно",
  },
  text: {
    true: "введите стихи",
    false: "ошибка, поле не должно быть пустым. Введите стихи",
  },
};
